three_Blade_Case/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;
motionSolverLibs ("libdynamicMesh.so");
solver		multiSolidBodyMotionSolver;

Rotor_AMI // name des zone von diesen zellen die bewegen soll sind
{
	solidBodyMotionFunction  rotatingNoF1IntegrationMotion;
	rotatingNoF1IntegrationMotionCoeffs
	{
		origin        (0 0 0);
		axis          (0 0 1);
		omega
		{
			type            scale;
			scale           linearRamp;
			scaleCoeffs
			{
					start           12e-4;
					duration        96e-4;
			}
			value 18.67;
		}
	}
}


WING_AMI_1 // name des zone von diesen zellen die bewegen soll sind
{
	solidBodyMotionFunction multiMotion;
	rotatingMotion
	{
		solidBodyMotionFunction  rotatingNoF1IntegrationMotion;
		rotatingNoF1IntegrationMotionCoeffs
		{
			origin        (0 0 0);
			axis          (0 0 1);
			omega
			{

				type            scale;
				scale           linearRamp;
				scaleCoeffs
					{
						start           12e-4;
						duration        96e-4;
					}
				value 18.67;
			}
		}
	}
	
	pitchingMotion  /// this instruction MUST come after rotor motion, otherwise the center of rotation is wrong
	{
		solidBodyMotionFunction  TrimMotion;
		origin        (0.25 0.000 0);
		amplitude     (0 0 -25);  // degs
		initialOffset 0; // offset of foil oscillation at t=0, multiple of pi, in rad
		omega
		{
			type            scale;
			scale           linearRamp;
			scaleCoeffs
				{
					start           12e-4;
					duration        96e-4;
				}
			value 18.67;
		}
		omega_value	18.67;
		#include 	"../system/Oscillations"
		PatchName	"_Blade1";
	}
	

}


WING_AMI_2 // name des zone von diesen zellen die bewegen soll sind
{
solidBodyMotionFunction multiMotion;
	rotatingMotion
	{
		solidBodyMotionFunction  rotatingNoF1IntegrationMotion;
		rotatingNoF1IntegrationMotionCoeffs
		{
			origin        (0 0 0);
			axis          (0 0 1);
			omega
			{

				type            scale;
				scale           linearRamp;
				scaleCoeffs
					{
						start           12e-4;
						duration        96e-4;
					}
				value 18.67;
			}
		}
	}
	
	pitchingMotion  /// this instruction MUST come after rotor motion, otherwise the center of rotation is wrong
	{
		solidBodyMotionFunction  TrimMotion;
		origin        (-0.125 0.2165 0);
		amplitude     (0 0 -25);  // degs
		initialOffset 0.67; // offset of foil oscillation at t=0, multiple of pi, in rad
		omega
		{
			type            scale;
			scale           linearRamp;
			scaleCoeffs
				{
					start           12e-4;
					duration        96e-4;
				}
			value 18.67;
		}
		omega_value	18.67;
		#include 	"../system/Oscillations"
		PatchName	"_Blade2";
	}
}

WING_AMI_3 // name des zone von diesen zellen die bewegen soll sind
{
solidBodyMotionFunction multiMotion;
	rotatingMotion
	{
		solidBodyMotionFunction  rotatingNoF1IntegrationMotion;
		rotatingNoF1IntegrationMotionCoeffs
		{
			origin        (0 0 0);
			axis          (0 0 1);
			omega
			{

				type            scale;
				scale           linearRamp;
				scaleCoeffs
					{
						start           12e-4;
						duration        96e-4;
					}
				value 18.67;
			}
		}
	}
	
	pitchingMotion  /// this instruction MUST come after rotor motion, otherwise the center of rotation is wrong
	{
		solidBodyMotionFunction  TrimMotion;
		origin        (-0.125 -0.2165 0);
		amplitude     (0 0 -25);  // degs
		initialOffset 1.33; // offset of foil oscillation at t=0, multiple of pi, in rad
		omega
		{
			type            scale;
			scale           linearRamp;
			scaleCoeffs
				{
					start           12e-4;
					duration        96e-4;
				}
			value 18.67;
		}
		omega_value	18.67;
		#include 	"../system/Oscillations"
		PatchName	"_Blade3";
	}
}



// ************************************************************************* //
