three_Blade_Case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
 "libTrimMotions.so"
);


DebugSwitches
{
    overset                 0; 	//0 off - 1 give more information
    dynamicOversetFvMesh    0;
    cellVolumeWeight        0;
    inverseDistance	    0;	//2 Force dumping of cellInterpolationWeight
}

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt endTime;

endTime 		10;
deltaT  		0.00005;
writeControl  		adjustableRunTime;


writeInterval   	0.001; // 1.5;
adjustTimeStep  	yes;
maxCo       		40;
maxDeltaT   		0.0018697; 

purgeWrite      0;

writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;



functions
{
#include "forces.allBlades"
}

// ************************************************************************* //
